{
  "crime_prevention_recommendations": [
    {
      "crime": "child abuse",
      "scenarios": [
        {
          "scenario": "Receiving unsolicited images or videos of children",
          "recommendations": [
            "Immediately report the incident to law enforcement, such as your local police station or the cybercrime cell.",
            "Do not download, save, or share the material under any circumstances, as this is illegal.",
            "Preserve all evidence, including sender details and message content, for investigation.",
            "Report the content anonymously via the Aarambh India Internet Hotline (aarambhindia.org/report) or call the CHILDLINE 1098 helpline for guidance and support.",
            "If you are unsure, consult with the National Commission for Protection of Child Rights (NCPCR) or your State Commission for Protection of Child Rights for further assistance."
          ]
        },
        {
          "scenario": "Witnessing child pornography online",
          "recommendations": [
            "Report the website or content immediately to the platform, cybercrime authorities, or via the Aarambh India Internet Hotline (aarambhindia.org/report).",
            "Call the CHILDLINE 1098 helpline to seek guidance on next steps.",
            "Take screenshots or note down URLs as evidence, but do not share or distribute the content.",
            "Do not interact with the content or the individuals involved."
          ]
        },
        {
          "scenario": "Being solicited to create or distribute child pornography",
          "recommendations": [
            "Refuse all contact and block the individual immediately.",
            "Report the approach to your nearest police station or cybercrime cell, as well as on the Aarambh India Internet Hotline.",
            "Save all messages or communication attempts as evidence for authorities.",
            "Seek legal counsel and support from child protection organizations if needed."
          ]
        },
        {
          "scenario": "Discovering child pornography on a family member’s device",
          "recommendations": [
            "Secure the device to prevent deletion or tampering with evidence.",
            "Report the situation to your local police station or cybercrime cell immediately.",
            "Contact CHILDLINE 1098 or your State Commission for Protection of Child Rights for further guidance.",
            "Consult with legal counsel to understand your responsibilities and protect the child’s interests."
          ]
        },
        {
          "scenario": "Finding or seeing concerning images of a child online",
          "recommendations": [
            "Report the images to the website or platform and to the Aarambh India Internet Hotline.",
            "Inform law enforcement or the cybercrime cell for prompt action.",
            "Take screenshots or note down the URLs as evidence, without sharing the content.",
            "If the child is known, sensitively inform their parents or guardians and offer support."
          ]
        },
        {
          "scenario": "Exposure to child pornography accidentally",
          "recommendations": [
            "Close the content immediately and clear your browsing data.",
            "Report the incident to the website/platform and, if needed, to the Aarambh India Internet Hotline.",
            "Call CHILDLINE 1098 if you feel distressed or need further guidance.",
            "Ensure your device has updated antivirus software to prevent future exposure."
          ]
        },
        {
          "scenario": "Receiving suspicious links to harmful sites",
          "recommendations": [
            "Do not click on suspicious or unknown links.",
            "Report the message to the platform or sender’s service provider.",
            "Use spam filters and security tools to block unwanted or dangerous messages.",
            "Keep your antivirus and security software updated."
          ]
        },
        {
          "scenario": "Children being approached by strangers online",
          "recommendations": [
            "Educate children about the risks of interacting with strangers on the internet, using resources from NCPCR or Aarambh India.",
            "Instruct children never to share personal information online.",
            "Use parental control software to monitor and restrict access to questionable sites.",
            "Encourage open dialogue so children feel comfortable reporting suspicious interactions."
          ]
        },
        {
          "scenario": "Concerns about children’s online friendships or exposure to inappropriate content",
          "recommendations": [
            "Monitor your child’s online friends and review their social media profiles regularly.",
            "Get to know your child’s friends and their parents to build a trusted support network.",
            "Encourage your child to avoid conversations or interactions that make them uncomfortable.",
            "Block and report any inappropriate content or contacts to the relevant platforms and authorities."
          ]
        },
        {
          "scenario": "Child pornography promotion in chat rooms or forums",
          "recommendations": [
            "Report the chat room or forum to the hosting platform and to the Aarambh India Internet Hotline.",
            "Inform law enforcement or the cybercrime cell with detailed information about the platform and activities.",
            "Preserve evidence such as screenshots or logs without engaging with participants."
          ]
        },
        {
          "scenario": "Suspected online abuse of a child",
          "recommendations": [
            "Report suspected abuse or exploitative images to the website/platform and to law enforcement or the cybercrime cell.",
            "Capture evidence carefully without distributing or sharing the content.",
            "Inform the child’s parents or guardians and offer support.",
            "Call CHILDLINE 1098 or contact NCPCR for additional guidance."
          ]
        },
        {
          "scenario": "Someone requesting nude images from you or your child",
          "recommendations": [
            "Report the user to the platform administrators and block them immediately.",
            "Delete all related messages to avoid accidental sharing.",
            "Inform a trusted adult, parent, or teacher for guidance and support.",
            "If you feel threatened, contact the police or CHILDLINE 1098."
          ]
        },
        {
          "scenario": "Child addicted to pornography",
          "recommendations": [
            "Have open and honest conversations with your child about the risks and consequences of pornography.",
            "Limit their access to technology and monitor their online activity.",
            "Seek professional counseling or therapy, preferably with a counselor experienced in child issues.",
            "Contact CHILDLINE 1098 or local child protection organizations for support."
          ]
        },
        {
          "scenario": "Dealing with peer pressure online",
          "recommendations": [
            "Encourage children to stand firm in their values and beliefs.",
            "Advise them to talk to a trusted adult if they feel pressured or uncomfortable.",
            "Educate them about the risks of participating in harmful online activities.",
            "Support them in avoiding situations that compromise their safety."
          ]
        },
        {
          "scenario": "Encountering something online that feels wrong or unsafe",
          "recommendations": [
            "Discuss the content with a trusted adult or counselor for perspective and support.",
            "Report suspicious or harmful content to the website/platform and, if necessary, to law enforcement.",
            "Avoid sharing or forwarding the material to prevent further harm.",
            "Do not click on any suspicious links associated with the content."
          ]
        }
      ]
    },    
    {
      "crime": "stalking",
      "scenarios": [
        {
          "scenario": "Receiving unwanted and persistent messages online",
          "recommendations": [
            "Block the sender immediately to prevent further contact.",
            "Save all messages as evidence for potential legal action.",
            "Report the user to the social media platform or messaging service.",
            "If the harassment escalates or threatens your safety, contact local police or cybercrime cell."
          ]
        },
        {
          "scenario": "Discovering someone is tracking your online activity",
          "recommendations": [
            "Change passwords for all your online accounts promptly.",
            "Enable two-factor authentication on all platforms for added security.",
            "Review and tighten your privacy settings on social media and other accounts.",
            "Install trusted anti-spyware and antivirus software to detect and remove tracking tools."
          ]
        },
        {
          "scenario": "A former partner is harassing you online",
          "recommendations": [
            "Document every instance of harassment, including screenshots and timestamps.",
            "Consider obtaining a restraining order under the Protection of Women from Domestic Violence Act or relevant IPC sections.",
            "Report the harassment to the platform or your internet service provider (ISP).",
            "Seek emotional support or counseling from trusted professionals or organizations like the National Commission for Women (NCW)."
          ]
        },
        {
          "scenario": "Someone is impersonating you online",
          "recommendations": [
            "Report the fake profile immediately to the social media platform for removal.",
            "Inform your contacts about the impersonation to prevent misinformation.",
            "File a complaint with the cybercrime cell under the IT Act, 2000.",
            "Monitor your financial and personal accounts for any suspicious activity."
          ]
        },
        {
          "scenario": "Receiving threats or intimidation online",
          "recommendations": [
            "Report all threats to your local police or cybercrime cell without delay.",
            "Save all threatening messages and communications as evidence.",
            "Block the sender to stop further contact.",
            "Seek emotional support from family, friends, or professional counselors."
          ]
        },
        {
          "scenario": "Someone you met online is harassing you in real life",
          "recommendations": [
            "Immediately inform local law enforcement and file a complaint.",
            "Report the harassment to the social media platform where you met the person.",
            "Alert your family and close friends about the situation for support and safety.",
            "Avoid being alone in vulnerable places and consider changing your routines."
          ]
        },
        {
          "scenario": "Worried your personal information has been leaked online",
          "recommendations": [
            "Report the data breach to local police and cybercrime authorities immediately.",
            "Change all your passwords and enable two-factor authentication.",
            "Inform your bank and update your financial information to prevent fraud.",
            "File a complaint with the platform where the leak occurred."
          ]
        },
        {
          "scenario": "Constant harassment related to your pictures online",
          "recommendations": [
            "Report the harassing user to the social media platform promptly.",
            "Block the user to prevent further contact.",
            "Set your profile and photo albums to private to restrict access.",
            "Inform trusted family or friends about the harassment for support."
          ]
        },
        {
          "scenario": "Someone you know is creating multiple fake accounts impersonating you",
          "recommendations": [
            "Report all fake accounts to the social media platform for immediate action.",
            "Block the individual responsible if identifiable.",
            "Inform your close contacts to prevent misinformation or misuse.",
            "If you feel physically threatened, report the matter to the police."
          ]
        },
        {
          "scenario": "Someone from your past is reaching out online and making you uncomfortable",
          "recommendations": [
            "Block the user and avoid any engagement or response.",
            "Consider tightening your social media privacy settings or deleting accounts if necessary.",
            "If you feel threatened or unsafe, report the situation to police or cybercrime authorities.",
            "Seek emotional support from trusted friends or professional counselors."
          ]
        },
        {
          "scenario": "Someone has hacked into your social media profile",
          "recommendations": [
            "Immediately change your passwords and enable two-factor authentication.",
            "Report the hacked account to the platform for recovery and investigation.",
            "Inform your contacts about the breach to avoid spreading misinformation.",
            "Scan your devices for malware and remove any suspicious files."
          ]
        },
        {
          "scenario": "Exposed private images leaked online",
          "recommendations": [
            "Report the leak to law enforcement and file a formal complaint.",
            "Request the hosting website or platform to remove the images immediately.",
            "Inform trusted family or friends to receive emotional support.",
            "Consider professional counseling to cope with the trauma."
          ]
        },
        {
          "scenario": "Receiving uncomfortable or inappropriate messages from your employer or boss",
          "recommendations": [
            "Report the behavior to your company’s HR department or grievance cell.",
            "Document all inappropriate messages and interactions carefully.",
            "Avoid responding to such messages to prevent escalation.",
            "If necessary, file a complaint with the police or the Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act authorities."
          ]
        },
        {
          "scenario": "Worried about your physical safety at work due to stalking or harassment",
          "recommendations": [
            "Report your concerns to HR or workplace security immediately.",
            "File a police complaint if you receive threats or face physical harm.",
            "Consider seeking a restraining order under applicable laws.",
            "Do not hesitate to assert your rights and seek support from colleagues or legal advisors."
          ]
        },
        {
          "scenario": "Concerned about your children being stalked or harassed online",
          "recommendations": [
            "Educate your children about online safety and the risks of interacting with strangers.",
            "Regularly monitor their social media profiles and online activities.",
            "Use parental control software to restrict access to unsafe content or contacts.",
            "Communicate with parents of your child’s friends to build a safe community."
          ]
        },
        {
          "scenario": "Being harassed online for your political beliefs",
          "recommendations": [
            "Block and report harassing users to the platform immediately.",
            "Do not engage with negative comments or provocations.",
            "Stand firm in your beliefs and seek support from like-minded communities.",
            "If threats escalate, report to cybercrime authorities and local police."
          ]
        },
        {
          "scenario": "Victim of a hate crime or targeted abuse online",
          "recommendations": [
            "Report the abuse to law enforcement and file an official complaint.",
            "Report the offending account to the social media platform for action.",
            "Seek counseling or mental health support to manage emotional impact.",
            "Do not let the abuse silence your voice or deter you from expressing yourself."
          ]
        },
        {
          "scenario": "Feeling threatened or unsafe due to online stalking",
          "recommendations": [
            "Immediately contact local police or cybercrime cell to report the threat.",
            "Report and block the threatening account on the platform.",
            "Keep records of all threatening messages or interactions.",
            "Consider professional counseling to support your mental well-being."
          ]
        },
        {
          "scenario": "Seeing concerning or harmful content related to your child online",
          "recommendations": [
            "Report the content to the hosting website or social media platform promptly.",
            "If the content involves criminal activity, inform law enforcement immediately.",
            "Support your child emotionally and assure them of your protection.",
            "Consider reaching out to child protection organizations like CHILDLINE 1098 or NCPCR for assistance."
          ]
        }
      ]
    },
    {
      "crime": "job fraud",
      "scenarios": [
        {
          "scenario": "Receiving an unsolicited job offer with high pay and little experience required",
          "recommendations": [
            "Be cautious and thoroughly research the company and job position before responding.",
            "Verify the company's legitimacy through official government portals like the Ministry of Corporate Affairs (MCA) or job portals like Naukri and LinkedIn.",
            "Never share personal or financial information upfront without confirming the employer’s authenticity."
          ]
        },
        {
          "scenario": "Being asked to pay for training or equipment before starting a job",
          "recommendations": [
            "Treat such requests as a red flag since genuine employers usually bear these costs.",
            "Request a detailed written explanation for any charges and verify their necessity.",
            "Compare these demands with similar legitimate job offers in the industry."
          ]
        },
        {
          "scenario": "Spotting a job posting with grammatical errors and unprofessional language",
          "recommendations": [
            "Exercise caution as poor language and presentation often indicate scams.",
            "Verify the company’s official contact details and website through government or trusted job portals.",
            "Look for consistent branding and professional communication before engaging further."
          ]
        },
        {
          "scenario": "Being pressured to make a quick decision without proper screening",
          "recommendations": [
            "Take your time to evaluate the offer; legitimate employers allow candidates to consider offers carefully.",
            "Request a formal job description, terms of employment, and a written contract.",
            "Consult with a career advisor, mentor, or trusted professional before committing."
          ]
        },
        {
          "scenario": "Recruiter or employer is difficult to reach or provides vague answers",
          "recommendations": [
            "Seek clear information about their role and the company’s background.",
            "Insist on a phone or video interview to verify authenticity.",
            "Look for employee reviews or testimonials on platforms like Glassdoor or LinkedIn."
          ]
        },
        {
          "scenario": "A supposed employer asks you for money",
          "recommendations": [
            "Do not send any money under any circumstances.",
            "Cut off all communication immediately.",
            "Report the fraudulent user to the job portal or website.",
            "If you have shared sensitive data, inform local cybercrime authorities."
          ]
        },
        {
          "scenario": "Contacted through an unofficial website or unknown phone number",
          "recommendations": [
            "Do not engage; hang up or ignore the communication.",
            "Verify the phone number and company details through official sources.",
            "Report suspicious contacts to the legitimate company and job portal.",
            "Change your passwords if your email or accounts may have been compromised."
          ]
        },
        {
          "scenario": "Asked to wire money to someone you met online regarding a job",
          "recommendations": [
            "Never transfer money to unknown or unverified individuals.",
            "End all contact immediately.",
            "Report the user to the job website or cybercrime cell.",
            "Notify law enforcement if your sensitive information has been compromised."
          ]
        },
        {
          "scenario": "Receiving a check from a fake company as part of a job offer",
          "recommendations": [
            "Do not cash or deposit any suspicious checks.",
            "Report the incident to the job portal and local cybercrime authorities.",
            "Inform your bank about the fraudulent activity.",
            "Stay vigilant for any further suspicious communications."
          ]
        },
        {
          "scenario": "Asked for bank account or credit card information by a supposed employer",
          "recommendations": [
            "Never share your financial information with unverified employers.",
            "Cut off all communication immediately.",
            "Report the suspicious activity to the job website and cybercrime authorities.",
            "Monitor your bank accounts for any unauthorized transactions."
          ]
        },
        {
          "scenario": "A supposed employer requests inappropriate photos",
          "recommendations": [
            "Immediately cease communication with the individual.",
            "Report the user to the job portal and local law enforcement.",
            "Block the user on all platforms.",
            "Seek support from trusted adults or counseling services if needed."
          ]
        },
        {
          "scenario": "Receiving threats related to a job offer or application",
          "recommendations": [
            "Report all threats to local police or cybercrime authorities without delay.",
            "Block the threatening individual on all platforms.",
            "Document and preserve all threatening messages as evidence.",
            "Seek emotional support from family, friends, or professional counselors."
          ]
        },
        {
          "scenario": "Job posting specifies hiring only from a specific demographic",
          "recommendations": [
            "Report such discriminatory job postings to the job portal and the Equal Opportunity Cell or Ministry of Labour and Employment.",
            "Understand that discrimination based on caste, religion, gender, or ethnicity is illegal under Indian law.",
            "Inform your community and encourage others to report similar instances.",
            "Consult legal experts if you face discrimination during hiring."
          ]
        },
        {
          "scenario": "Job posting contains obvious errors or unprofessional details",
          "recommendations": [
            "Avoid engaging with such job offers as they often indicate scams.",
            "Report the suspicious posting to the job website immediately.",
            "Do not share personal information or apply to such listings."
          ]
        },
        {
          "scenario": "Job posting lists incorrect or suspicious contact numbers",
          "recommendations": [
            "Do not trust or respond to such contact details.",
            "Report the job posting to the platform for verification.",
            "Avoid applying to jobs with unverifiable contact information."
          ]
        },
        {
          "scenario": "Job posting offers an unrealistically high salary or benefits",
          "recommendations": [
            "Be skeptical of offers that seem too good to be true.",
            "Avoid sharing personal or financial information with such employers.",
            "Report the suspicious posting to the job portal.",
            "Research average salaries for similar roles to identify red flags."
          ]
        },
        {
          "scenario": "Suspecting you have been scammed of money related to a job",
          "recommendations": [
            "Immediately report the fraud to local police and cybercrime authorities.",
            "File a complaint with the job website or platform.",
            "Contact your bank to explore options for refund or fraud protection.",
            "Seek advice and support from trusted adults or legal professionals."
          ]
        },
        {
          "scenario": "Asked about immigration status or ethnic heritage during job application",
          "recommendations": [
            "Report such discriminatory questions to the job portal and legal authorities.",
            "Know that discrimination based on ethnicity or immigration status is illegal in India.",
            "Avoid applying to such postings and seek legal counsel if discriminated against.",
            "Inform community organizations or labor rights groups for support."
          ]
        },
        {
          "scenario": "A minor is contacted about a job opportunity",
          "recommendations": [
            "Inform your parents or guardians immediately about the contact.",
            "Avoid sharing any personal or sensitive information.",
            "Report any inappropriate or suspicious communication to law enforcement.",
            "Be cautious as minors are often targeted for exploitation."
          ]
        },
        {
          "scenario": "Asked to send sensitive documents such as Aadhaar or PAN card",
          "recommendations": [
            "Verify the employer’s authenticity before sharing any sensitive documents.",
            "If unsure, cut off contact and research more about the company.",
            "Consult parents or trusted adults before sharing important documents.",
            "Report suspicious requests to the job portal and cybercrime authorities."
          ]
        }
      ]
    },
    {
      "crime": "phishing",
      "scenarios": [
        {
          "scenario": "Receiving a call claiming to be from your bank requesting your ATM PIN",
          "recommendations": [
            "Hang up immediately, as your bank will never ask for your PIN over the phone.",
            "Call your bank directly using the number on your official bank statements or website to verify the call.",
            "Report the incident to your bank’s fraud department and local cybercrime authorities."
          ]
        },
        {
          "scenario": "Caller states they are from the Income Tax Department and demand immediate payment to avoid legal action",
          "recommendations": [
            "Hang up, as the Income Tax Department typically communicates via official letters or notices.",
            "Report the call to the Income Tax Department's official channels and the cybercrime cell.",
            "Never provide personal or financial information over the phone without verifying the caller's identity through official sources."
          ]
        },
        {
          "scenario": "Someone claims to be a tech support representative needing remote access to your computer",
          "recommendations": [
            "Refuse access, as legitimate tech support will not ask for unsolicited remote access.",
            "Run a full scan with your antivirus software.",
            "Change your passwords for all online accounts, especially those related to banking or finance."
          ]
        },
        {
          "scenario": "Caller offers a prize or sweepstakes winnings but requires you to pay a fee to claim it",
          "recommendations": [
            "Be extremely cautious, as this is a common scam tactic.",
            "Never provide personal or financial information to claim a prize.",
            "Report the call to the National Cyber Crime Reporting Portal and consumer protection agencies."
          ]
        },
        {
          "scenario": "Receiving a call about suspicious activity on your credit card, requesting your card number for verification",
          "recommendations": [
            "Hang up and contact your bank directly using the number on your card or official website.",
            "Never provide your card number or CVV to an unverified caller.",
            "Monitor your credit card statements regularly and enable transaction alerts."
          ]
        },
        {
          "scenario": "Receiving an email claiming your bank account has been compromised, requesting you to verify your login details",
          "recommendations": [
            "Do not click on any links in the email; instead, access your bank account through the official website.",
            "Report the phishing email to your bank and the National Cyber Crime Reporting Portal.",
            "Change your online banking password immediately and enable two-factor authentication."
          ]
        },
        {
          "scenario": "Being directed to a fake website that looks identical to a legitimate one",
          "recommendations": [
            "Carefully verify the website’s URL, as phishing sites often use misspelled or altered URLs.",
            "Ensure the website has a secure connection (HTTPS) before entering any personal information.",
            "Use a password manager to detect fake login pages and avoid entering credentials."
          ]
        },
        {
          "scenario": "Email asks you to update your credit card information for a subscription service you use",
          "recommendations": [
            "Log in to your account directly through the official website, not through the email.",
            "Report the phishing email to the subscription service’s customer support.",
            "Monitor your credit card statements regularly for any unauthorized charges."
          ]
        },
        {
          "scenario": "Receiving an urgent email claiming you have won a lottery or prize, needing to pay a fee to claim it",
          "recommendations": [
            "Be extremely cautious, as this is a common scam tactic.",
            "Never provide personal or financial information to claim a prize.",
            "Report the email to the consumer protection agencies and cybercrime authorities."
          ]
        },
        {
          "scenario": "An email warns that your account will be suspended if you don’t take immediate action",
          "recommendations": [
            "Contact the company directly through their official website or phone number to verify the email.",
            "Check your account settings and security preferences through the official platform.",
            "Enable two-factor authentication for added security."
          ]
        },
        {
          "scenario": "Unknown number messages or calls asking for personal information",
          "recommendations": [
            "Block the number immediately to prevent further contact.",
            "Report the number to the Telecom Regulatory Authority of India (TRAI) and cybercrime authorities.",
            "Delete any messages from the sender and avoid engaging with unknown contacts."
          ]
        },
        {
          "scenario": "Trusted account contacts you online and asks for personal information",
          "recommendations": [
            "Verify the request by contacting the person through a different, established channel.",
            "If the request seems suspicious, report the account to the platform as potentially compromised.",
            "Inform your contacts about the phishing attempt to prevent them from falling victim."
          ]
        },
        {
          "scenario": "Seeing something online that seems too good to be true",
          "recommendations": [
            "Research the information online through trusted sources to verify its legitimacy.",
            "Consult with trusted friends or family members before taking any action.",
            "Be cautious of any offer that requires you to share personal or financial information upfront."
          ]
        },
        {
          "scenario": "Told you got a call from a real organization and your details are not safe",
          "recommendations": [
            "Hang up immediately and do not provide any information.",
            "Research the organization online to check its legitimacy through official sources.",
            "Contact the organization directly to verify the call and ask about preventive measures."
          ]
        },
        {
          "scenario": "A friend’s account has been compromised and is asking you for personal information",
          "recommendations": [
            "Contact your friend through an alternative channel to confirm the message's authenticity.",
            "If the account is indeed compromised, report it to the platform immediately.",
            "Avoid sharing any personal information and alert other contacts about the potential scam."
          ]
        },
        {
          "scenario": "An email from a company has bad grammar and spelling errors",
          "recommendations": [
            "Be highly suspicious, as legitimate companies typically have professional communication.",
            "Report the email as phishing and block the sender.",
            "Avoid clicking on any links or downloading any attachments from the email."
          ]
        },
        {
          "scenario": "Asked to share a personal key or OTP (One-Time Password)",
          "recommendations": [
            "Never share personal keys or OTPs with anyone, as they are meant for your exclusive use.",
            "Ignore such requests and report them to the relevant service provider.",
            "Stay vigilant and protect your personal information from potential harm."
          ]
        }
      ]
    },
    {
      "crime": "impersonation and identity theft",
      "scenarios": [
        {
          "scenario": "Receiving a suspicious email asking for your bank account details",
          "recommendations": [
            "Do not click on any links within the email. Access your bank's website directly through a trusted browser.",
            "Report the phishing email to your bank's fraud department and the Indian Computer Emergency Response Team (CERT-In).",
            "Change your online banking password immediately and enable two-factor authentication for added security."
          ]
        },
        {
          "scenario": "Discovering that someone has opened a credit card or loan account in your name",
          "recommendations": [
            "Contact the credit bureau CIBIL (Credit Information Bureau India Limited) to place a fraud alert on your credit report.",
            "File a First Information Report (FIR) at your local police station or cybercrime cell.",
            "Contact the credit card company or financial institution to close the fraudulent account and dispute any charges."
          ]
        },
        {
          "scenario": "Your Aadhaar number or PAN card information has been compromised",
          "recommendations": [
            "Report the theft immediately to the Unique Identification Authority of India (UIDAI) or the Income Tax Department.",
            "Monitor your credit report and bank statements for any signs of fraudulent activity.",
            "Consider placing a credit freeze with CIBIL to prevent unauthorized credit accounts from being opened."
          ]
        },
        {
          "scenario": "Someone has filed a fraudulent tax return using your PAN card",
          "recommendations": [
            "Contact the Income Tax Department immediately to report the identity theft.",
            "File an identity theft affidavit with the Income Tax Department.",
            "Consider filing a police report and inform your bank about the situation."
          ]
        },
        {
          "scenario": "Finding unauthorized or fraudulent charges on your credit card",
          "recommendations": [
            "Report the fraudulent charges to your credit card company immediately and request a chargeback.",
            "Request a new credit card with a new card number to prevent further unauthorized transactions.",
            "Monitor your credit card statements regularly and enable transaction alerts to detect any suspicious activity promptly."
          ]
        },
        {
          "scenario": "Getting scammed into sharing your personal or financial information",
          "recommendations": [
            "Change all your online passwords immediately, especially for sensitive accounts like banking and email.",
            "Alert your bank that your information may have been compromised and request them to monitor your accounts closely.",
            "Report the incident to the cybercrime cell and consumer protection agencies.",
            "Consider placing a credit freeze to prevent unauthorized access to your credit report."
          ]
        },
        {
          "scenario": "Someone is asking you about a loved one's personal information",
          "recommendations": [
            "Do not provide any personal information, as this could be a social engineering attack.",
            "Verify the person's identity and legitimacy through official channels.",
            "Contact local law enforcement or cybercrime authorities to report the suspicious activity.",
            "Report the suspicious account or contact to the platform or service provider."
          ]
        },
        {
          "scenario": "Personal information on your device is not adequately protected",
          "recommendations": [
            "Install and regularly update antivirus and anti-malware software to protect against threats.",
            "Change your passwords and enable strong authentication methods like biometrics or OTPs.",
            "Report any data leaks or breaches to the appropriate authorities.",
            "Freeze your credit report and monitor your bank accounts for any unauthorized transactions."
          ]
        },
        {
          "scenario": "Receiving emails or SMS messages requesting your personal information",
          "recommendations": [
            "Report the phishing email or message to the platform or service provider.",
            "Delete any links or attachments provided in the message, as they could be malicious.",
            "Change your passwords for all your online accounts.",
            "Freeze your credit report and monitor your bank accounts for any suspicious activity."
          ]
        },
        {
          "scenario": "Suspecting that your email account has been hacked or compromised",
          "recommendations": [
            "Change your email password immediately and choose a strong, unique password.",
            "Enable two-factor authentication to add an extra layer of security.",
            "Update your recovery phone number and email address to ensure you can regain access if needed.",
            "Be cautious about sharing your personal information and avoid clicking on suspicious links."
          ]
        },
        {
          "scenario": "Suspecting that a family member's phone or account has been hacked",
          "recommendations": [
            "Install antivirus and anti-malware software on the device to scan for threats.",
            "Contact law enforcement or cybercrime authorities to report the incident.",
            "Inform your bank about the potential fraud and monitor your accounts closely.",
            "Change passwords for all important accounts and enable two-factor authentication."
          ]
        },
        {
          "scenario": "Receiving suspicious emails or messages from a familiar business",
          "recommendations": [
            "Contact the business directly through their official website or phone number to verify the communication.",
            "If fraud has occurred, report the incident to law enforcement and cybercrime authorities.",
            "Avoid clicking on any links or attachments in the suspicious email or message.",
            "Use antivirus software to scan your device for potential threats."
          ]
        },
        {
          "scenario": "A personal document or financial statement has been stolen from your mailbox",
          "recommendations": [
            "Contact the Aadhaar or PAN card issuing authority to report the theft.",
            "Notify your bank and credit card companies to monitor your accounts for any unauthorized activity.",
            "Report the incident to local law enforcement and the postal service.",
            "Consider placing a fraud alert on your credit report to prevent identity theft."
          ]
        },
        {
          "scenario": "Worried that your bank account has been compromised due to identity theft",
          "recommendations": [
            "Contact your bank immediately to report the potential compromise and request them to freeze your account.",
            "Report the incident to law enforcement and cybercrime authorities.",
            "File a complaint with the consumer court to protect your rights.",
            "Change your passwords and monitor your financial statements for any suspicious activity."
          ]
        },
        {
          "scenario": "Finding your personal information has been leaked or exposed online",
          "recommendations": [
            "Change all your passwords for online accounts and enable two-factor authentication.",
            "Contact law enforcement and cybercrime authorities to report the data breach.",
            "Report the leak to the website or platform where the information was exposed.",
            "Monitor your credit report and financial statements for any signs of identity theft."
          ]
        },
        {
          "scenario": "Seeing suspicious activity on your child's social media account",
          "recommendations": [
            "Talk to your child about the dangers of online strangers and the importance of protecting their personal information.",
            "Monitor who is interacting with your child online and review their social media activity.",
            "Use parental control software to restrict access to inappropriate content and contacts.",
            "Contact law enforcement if there are any signs of grooming or online exploitation."
          ]
        },
        {
          "scenario": "Suspecting that your child's personal information has been stolen or compromised",
          "recommendations": [
            "Talk to your child about the risks of sharing personal information online and offline.",
            "Monitor their online activity and social media profiles for any signs of identity theft.",
            "Use parental controls to restrict access to unsafe websites and contacts.",
            "Contact law enforcement or child protection agencies if there are any signs of danger."
          ]
        },
        {
          "scenario": "Receiving fake emails or SMS messages from seemingly legitimate companies",
          "recommendations": [
            "Double-check the sender's email address or phone number and verify it with the official organization.",
            "If the message seems suspicious, contact the real company to confirm its authenticity.",
            "Contact your bank or financial institutions to prevent any fraudulent transactions.",
            "Contact law enforcement or cybercrime authorities if you believe you have been targeted."
          ]
        }
      ]
    },
    {
      "crime": "ransomware",
      "scenarios": [
        {
          "scenario": "Opening an email attachment from an unknown sender",
          "recommendations": [
            "Exercise extreme caution and verify the sender's identity through a separate, trusted channel before opening any attachments.",
            "Scan the attachment with a reputable antivirus or anti-malware software before opening it.",
            "Disable or avoid enabling macros in attachments, especially from unknown or untrusted sources, as they can execute malicious code."
          ]
        },
        {
          "scenario": "Clicking on a suspicious link in an email or on a website",
          "recommendations": [
            "Verify the URL by hovering over the link to see the actual destination before clicking.",
            "Avoid clicking on links from unknown or untrusted sources.",
            "Use a browser extension or security tool to block or warn about malicious websites and links."
          ]
        },
        {
          "scenario": "Not having up-to-date antivirus or anti-malware software",
          "recommendations": [
            "Install a reputable antivirus or anti-malware software and keep it regularly updated.",
            "Run full system scans regularly to detect and remove any malware.",
            "Enable real-time protection to prevent infections from newly encountered threats."
          ]
        },
        {
          "scenario": "Using outdated software or operating systems",
          "recommendations": [
            "Keep your software and operating systems up to date with the latest security patches and updates.",
            "Enable automatic updates to ensure you have the latest protections against vulnerabilities.",
            "Retire or isolate outdated software that is no longer supported to minimize potential risks."
          ]
        },
        {
          "scenario": "Not backing up your data regularly",
          "recommendations": [
            "Back up your data regularly to an external hard drive, network location, or cloud storage service.",
            "Test your backups regularly to ensure they can be restored successfully and that the data is intact.",
            "Store your backups offline or in a separate, secure location to prevent them from being encrypted or compromised by ransomware."
          ]
        },
        {
          "scenario": "Unknown software is requesting your personal data or sensitive permissions",
          "recommendations": [
            "Do not provide any personal information or grant sensitive permissions to unknown or untrusted software.",
            "Uninstall the software immediately if you suspect it may be malicious.",
            "Run a full system scan with your antivirus or anti-malware software.",
            "Report the suspicious software to local cybercrime authorities or CERT-In."
          ]
        },
        {
          "scenario": "Receiving a message stating that your data has been encrypted and a ransom is demanded",
          "recommendations": [
            "Contact local law enforcement and CERT-In immediately to report the ransomware attack.",
            "Report the email address, website, or contact information used by the attackers.",
            "Disconnect your device from the network and the internet to prevent further spread.",
            "Do not pay the ransom, as this may not guarantee data recovery and could encourage further attacks."
          ]
        },
        {
          "scenario": "Seeing a link or message online that promises a prize, gift card, or other enticing offer",
          "recommendations": [
            "Be extremely cautious and skeptical, as such offers are often used to spread malware or ransomware.",
            "Run a full system scan with your antivirus software to detect any potential infections.",
            "Monitor your network activity and data usage for any unusual patterns.",
            "Back up your data to a safe and isolated location to prepare for potential data loss."
          ]
        },
        {
          "scenario": "Software you installed is malfunctioning and requests unusual or excessive permissions to fix the issue",
          "recommendations": [
            "Exercise caution, as this could be a sign of ransomware or malware.",
            "Run a full system scan with your antivirus or anti-malware software.",
            "Uninstall the program immediately if you suspect it may be malicious.",
            "Restart your computer in safe mode to prevent the software from running automatically."
          ]
        },
        {
          "scenario": "Your computer is behaving strangely after downloading files or software from an unknown source",
          "recommendations": [
            "There is a high chance that your computer may be infected with malware or ransomware.",
            "Run a full system scan with your antivirus or anti-malware software.",
            "Uninstall the program or files immediately if you suspect they may be malicious.",
            "Restart your computer and monitor its behavior for any further signs of infection."
          ]
        },
        {
          "scenario": "Concerned about your children visiting unsafe websites or downloading malicious content",
          "recommendations": [
            "Check your children's social media activity and online behavior regularly.",
            "Monitor which websites they visit and the content they download.",
            "Educate them about the dangers of ransomware, phishing, and online scams.",
            "Use parental control software to restrict access to unsafe content and monitor their online activity."
          ]
        },
        {
          "scenario": "Software or a website is requesting remote access or control over your computer",
          "recommendations": [
            "Never grant remote access to your computer unless you are certain of the legitimacy of the request.",
            "Uninstall the program immediately if you suspect it may be malicious.",
            "Run a full system scan with your antivirus or anti-malware software.",
            "Check your device for any unusual activity or settings changes."
          ]
        },
        {
          "scenario": "Receiving threatening messages or demands related to your personal or financial information",
          "recommendations": [
            "Contact local law enforcement and cybercrime authorities immediately to report the threats.",
            "Block the account or contact and avoid any further communication.",
            "Monitor your credit reports and bank accounts for any signs of unauthorized activity.",
            "Take screenshots or document the threats as evidence for law enforcement."
          ]
        },
        {
          "scenario": "Discovering that your computer has been hacked and is behaving erratically",
          "recommendations": [
            "Run a full system scan with your antivirus or anti-malware software to detect and remove any malware.",
            "Restart your computer to terminate any malicious processes.",
            "Monitor your bank accounts and financial statements for any unauthorized transactions.",
            "Contact local law enforcement or cybercrime authorities to report the incident."
          ]
        },
        {
          "scenario": "Downloaded a file from an untrusted source and are now concerned about potential infection",
          "recommendations": [
            "Run a full system scan with your antivirus or anti-malware software to detect any malware.",
            "Restart your computer to ensure any malicious processes are terminated.",
            "Monitor your network activity and data usage for any unusual patterns.",
            "Inform your friends and family about the potential risk to prevent them from downloading the same file."
          ]
        },
        {
          "scenario": "An app you installed is requesting excessive or unnecessary permissions to manage your files",
          "recommendations": [
            "Be cautious, especially if you installed the app from a third-party source.",
            "Report the suspicious app to local law enforcement or cybercrime authorities.",
            "Run a full system scan with your antivirus or anti-malware software.",
            "Monitor your data for any signs of unauthorized access or modification."
          ]
        },
        {
          "scenario": "Being contacted and told that your data has been compromised and is at risk of being leaked",
          "recommendations": [
            "Do not pay them any money, as this may not guarantee the safety of your data and could encourage further extortion.",
            "There is no guarantee that the attackers can or will protect your data even if you pay.",
            "Contact local law enforcement and cybercrime authorities to report the extortion attempt.",
            "Monitor your credit reports and financial accounts for any signs of identity theft or fraud."
          ]
        },
        {
          "scenario": "Someone threatens your life or physical safety if you do not comply with their demands",
          "recommendations": [
            "Call the authorities immediately and provide them with all available information.",
            "Block the person from contacting you and save any evidence of the threats.",
            "Research online for a good defense lawyer and contact them for legal advice.",
            "Contact trusted adults for assistance if you need emotional support or guidance."
          ]
        },
        {
          "scenario": "Receiving calls or messages stating that your files are being deleted or damaged",
          "recommendations": [
            "Turn off the internet connection immediately to prevent further damage.",
            "Restart your computer in safe mode to limit the impact of any malware.",
            "Look at previous backups to restore your data.",
            "Install a reputable antivirus or anti-malware software and contact the local police."
          ]
        },
        {
          "scenario": "A program has been compromised and is requesting that you turn off your computer",
          "recommendations": [
            "Find out more about the program and whether it can be trusted.",
            "Contact the company responsible for the program to find out what has happened.",
            "Be safe online and do not click on harmful links.",
            "Consult with trusted technical experts to determine the best course of action."
          ]
        }
      ]
    },
    {
      "crime": "data breach",
      "scenarios": [
        {
          "scenario": "Receiving a notification from a company that your account information may have been exposed",
          "recommendations": [
            "Change your password immediately for that account and any other accounts where you used the same password.",
            "Monitor your credit report through CIBIL or other credit bureaus for any suspicious or unauthorized activity.",
            "Enable two-factor authentication (2FA) for added security wherever available, using methods like OTPs or authenticator apps."
          ]
        },
        {
          "scenario": "Discovering that your personal information (e.g., Aadhaar, PAN) has been posted online",
          "recommendations": [
            "Contact the website or platform to request the immediate removal of your personal information.",
            "Monitor your credit report through CIBIL for any signs of fraudulent activity or unauthorized credit inquiries.",
            "Consider placing a credit freeze with CIBIL to prevent unauthorized credit accounts from being opened in your name."
          ]
        },
        {
          "scenario": "Your email address has been included in a list of breached accounts",
          "recommendations": [
            "Change your password for your email account and any other accounts where you used the same password.",
            "Enable two-factor authentication (2FA) for added security on your email and other critical accounts.",
            "Be vigilant for phishing emails or messages that may target you due to the breach."
          ]
        },
        {
          "scenario": "An unauthorized transaction appears on your bank statement",
          "recommendations": [
            "Contact your bank immediately to report the fraudulent transaction and request a chargeback.",
            "Request a new debit or credit card with a new number to prevent further unauthorized transactions.",
            "Monitor your bank account and credit card statements regularly for any signs of suspicious activity."
          ]
        },
        {
          "scenario": "You receive an alert that someone has tried to open a new account in your name",
          "recommendations": [
            "Contact the credit reporting agency CIBIL to place a fraud alert on your credit report.",
            "File a report with the cybercrime cell and your local police station.",
            "Monitor your credit report regularly for any unauthorized activity and consider freezing your credit."
          ]
        },
        {
          "scenario": "Finding out that your personal data was leaked during a data breach",
          "recommendations": [
            "Change passwords immediately for all affected accounts and enable two-factor authentication (2FA).",
            "Set up transaction alerts on your financial accounts to monitor for any unusual activity.",
            "Consider using identity theft protection services offered by banks or other financial institutions."
          ]
        },
        {
          "scenario": "Receiving unsolicited calls or messages asking for personal information after a data breach",
          "recommendations": [
            "Do not provide any personal information over the phone or via text to unverified callers or senders.",
            "Hang up or disregard the message and verify the caller's or sender's identity by contacting the company directly through official channels.",
            "Report suspicious calls or messages to the Telecom Regulatory Authority of India (TRAI) and cybercrime authorities."
          ]
        },
        {
          "scenario": "Discovering that sensitive personal documents (e.g., Aadhaar, PAN) have been stolen",
          "recommendations": [
            "Report the theft to local law enforcement and obtain a police report for documentation.",
            "Cancel any affected accounts or services linked to the stolen documents and request new credentials.",
            "Consider placing a fraud alert or credit freeze on your credit report to prevent unauthorized access to your financial information."
          ]
        },
        {
          "scenario": "Receiving phishing emails or SMS messages related to a data breach",
          "recommendations": [
            "Do not click on any links or download any attachments from suspicious emails or messages.",
            "Report phishing attempts to the email or messaging service provider and relevant authorities.",
            "Regularly update passwords and security questions on your sensitive accounts and enable two-factor authentication (2FA)."
          ]
        },
        {
          "scenario": "Noticing strange activity on your social media accounts after a breach",
          "recommendations": [
            "Change your passwords immediately and enable two-factor authentication (2FA) on all your social media accounts.",
            "Review your account settings for any unauthorized changes, such as new followers, connections, or profile information.",
            "Inform your friends and followers about potential scams or phishing attempts originating from your compromised account."
          ]
        },
        {
          "scenario": "Being notified by your employer about a data breach affecting employee information",
          "recommendations": [
            "Follow any instructions provided by your employer regarding monitoring and securing your personal data.",
            "Change passwords for work-related accounts and personal accounts as necessary, and enable two-factor authentication (2FA).",
            "Stay informed about updates related to the breach from your employer and take any recommended actions."
          ]
        },
        {
          "scenario": "Seeing unauthorized access attempts on your online accounts after a breach",
          "recommendations": [
            "Immediately change passwords for affected accounts and enable two-factor authentication (2FA) for added security.",
            "Review account activity logs for any unauthorized transactions or changes and report them to the service provider.",
            "Contact customer support of the affected service providers if you notice any suspicious activity or unauthorized access attempts."
          ]
        },
        {
          "scenario": "Receiving notifications from credit monitoring services about unusual inquiries or new accounts",
          "recommendations": [
            "Investigate each inquiry or new account to determine if it was authorized or fraudulent.",
            "Place fraud alerts with credit reporting agencies such as CIBIL if you suspect identity theft or unauthorized access to your credit information.",
            "Consider freezing your credit with CIBIL if you notice multiple suspicious inquiries or fraudulent accounts."
          ]
        },
        {
          "scenario": "Finding out that your login credentials have been leaked in a data breach",
          "recommendations": [
            "Change passwords immediately for all affected accounts, especially financial ones, and enable two-factor authentication (2FA).",
            "Use a password manager to generate strong, unique passwords for each account and store them securely.",
            "Enable two-factor authentication (2FA) wherever possible, using methods like OTPs or authenticator apps."
          ]
        },
        {
          "scenario": "Being targeted by scammers claiming to help after a data breach",
          "recommendations": [
            "Do not engage with unsolicited offers of help regarding data breaches or provide any personal information to unverified sources.",
            "Verify any claims or offers by contacting official organizations directly through trusted channels.",
            "Report scams and phishing attempts to relevant authorities, such as the cybercrime cell or consumer protection agencies."
          ]
        }
      ]
    },
    {
      "crime": "online drug trafficking",
      "scenarios": [
        {
          "scenario": "Receiving unsolicited messages or emails advertising drugs",
          "recommendations": [
            "Report the message to the platform or email provider immediately to prevent further distribution.",
            "Block the sender to avoid any further contact or harassment.",
            "Do not click on any links or respond to the message, as they may lead to harmful content or scams."
          ]
        },
        {
          "scenario": "Seeing suspicious posts or advertisements on social media promoting drug sales",
          "recommendations": [
            "Report the post to the social media platform to help them take action against illegal activities.",
            "Avoid engaging with the content to prevent inadvertently promoting or encouraging drug trafficking.",
            "Be wary of profiles or pages promoting illegal activities and do not interact with them."
          ]
        },
        {
          "scenario": "Being asked to purchase or distribute drugs online",
          "recommendations": [
            "Refuse the request firmly and cease all communication with the individual.",
            "Report the user to the online platform or social media site to alert them to the illegal activity.",
            "Contact local law enforcement with details of the interaction, including screenshots or saved messages."
          ]
        },
        {
          "scenario": "Discovering a website or online forum openly selling or promoting illegal drugs",
          "recommendations": [
            "Report the website to your local law enforcement agency or the cybercrime cell for investigation.",
            "Avoid accessing the website or engaging in any activities that could be considered illegal.",
            "Do not share or promote the website with others."
          ]
        },
        {
          "scenario": "Finding a suspicious package that you suspect contains illegal drugs",
          "recommendations": [
            "Contact law enforcement immediately and provide them with details of the package.",
            "Report the incident to the postal service or courier company.",
            "Avoid touching or opening the package to prevent potential harm or legal implications.",
            "Inform trusted authorities, such as your family or community leaders, about the situation."
          ]
        },
        {
          "scenario": "Someone claiming that your family will be harmed if you don't sell drugs",
          "recommendations": [
            "Call the police immediately to report the threat and seek protection.",
            "Contact local law enforcement to provide them with details of the threat and individuals involved.",
            "Report the incident to the online platform or website where the threat originated.",
            "Monitor your surroundings and inform friends, family, and trusted authorities about the threat."
          ]
        },
        {
          "scenario": "Worried about suspicious online behavior or contact related to drug trafficking",
          "recommendations": [
            "Tell trusted adults, such as parents, teachers, or counselors, about your concerns.",
            "Do not click on any links or visit websites that seem suspicious or promote illegal activities.",
            "Contact online or in-person help services, such as helplines or support groups, for guidance and support."
          ]
        },
        {
          "scenario": "Discovering that a friend has become addicted to drugs",
          "recommendations": [
            "Offer your support and encouragement to help your friend seek treatment.",
            "Contact your friend's parents or guardians to inform them about the situation.",
            "Contact help services for both you and your friend, such as addiction helplines or counseling services.",
            "Share accurate information about addiction and treatment with your friends to promote awareness and support."
          ]
        },
        {
          "scenario": "Realizing that your friends on an online platform are promoting or engaging in illegal activity",
          "recommendations": [
            "Avoid visiting or participating in these sites or activities.",
            "Report your friends' activities to the police or cybercrime cell.",
            "Tell trusted authorities, such as parents, teachers, or community leaders, and trusted friends about the situation."
          ]
        },
        {
          "scenario": "Not sure if your family member or friend is using or involved in illegal drugs",
          "recommendations": [
            "Stay strong and focus on their best interests and well-being.",
            "Offer to talk to them and create a safe and non-judgmental space for them to share their experiences.",
            "Make them feel safe so they can tell you anything without fear of judgment or punishment.",
            "Provide support and encourage them to seek professional help if needed."
          ]
        },
        {
          "scenario": "Discovering illegal drugs in the mail or in someone's possession",
          "recommendations": [
            "Contact law enforcement immediately to report the situation.",
            "Avoid touching or moving the illegal substances to prevent potential harm or legal implications.",
            "Wash any area that you think might have been exposed to the drugs to minimize potential risks.",
            "Inform relevant authorities about the incident and cooperate with their investigation."
          ]
        },
        {
          "scenario": "Not sure where your child is going or what they are doing when they leave the house",
          "recommendations": [
            "Talk with your child and try to understand their activities and whereabouts.",
            "Make a plan to stay in contact with them and ensure their safety.",
            "Let their trusted friends know what has happened and see if they can provide assistance or support.",
            "Don't be afraid to ask for help from family, friends, or community resources."
          ]
        },
        {
          "scenario": "Someone said they would give you money if you delivered drugs",
          "recommendations": [
            "Avoid touching the drugs and providing any assistance to that individual.",
            "Contact law enforcement immediately and report the offer.",
            "Recognize that there are many other legitimate opportunities to make money without engaging in illegal activities.",
            "Seek out a guidance counselor, mentor, or trusted adult to provide assistance and support."
          ]
        },
        {
          "scenario": "An online person asked you to use your car for drug delivery",
          "recommendations": [
            "Avoid using your car for drug delivery, as it is illegal and dangerous.",
            "Recognize that they are taking advantage of your situation and potentially putting you at risk.",
            "Report this instance to local law enforcement.",
            "Look for alternate, legal ways to earn income or support yourself."
          ]
        },
        {
          "scenario": "Someone contacted you and told you that your name will be in jeopardy if you don't cooperate",
          "recommendations": [
            "Avoid getting scammed or talked into the situation, as it could have serious legal consequences.",
            "Reach out to law enforcement and seek their guidance on the best course of action.",
            "Research online about this type of scam or threat to understand the risks involved.",
            "Let your lawyer and chartered accountant (CA) know to see what legal or business impacts might arise."
          ]
        },
        {
          "scenario": "Believing that selling drugs online is not as illegal as doing it in person",
          "recommendations": [
            "Understand that selling drugs online is just as illegal and carries severe consequences.",
            "Do not engage in any form of drug trafficking or distribution.",
            "Recognize that there are long-term effects if you were to get caught, including legal penalties and social stigma.",
            "Realize that it would be illegal for both the person selling the drugs and the person distributing them."
          ]
        },
        {
          "scenario": "Your friends are trying to involve you in selling drugs online",
          "recommendations": [
            "Tell them not to do it and explain the risks and consequences of their actions.",
            "If they feel threatened or coerced, reach out to law enforcement with them to report the situation.",
            "Provide assistance and offer guidance on how to find alternative solutions.",
            "Report them to the authorities if they become violent or engage in illegal activities."
          ]
        },
        {
          "scenario": "Your friends are involved in online drug trafficking but have asked you to not say anything",
          "recommendations": [
            "Encourage them to stop and seek help, emphasizing the dangers and legal ramifications of their actions.",
            "Inform the police or cybercrime authorities about their activities.",
            "Let their parents or guardians know what is happening to ensure their safety and well-being.",
            "Try to determine where they are getting the drugs and see if a pattern emerges that could help law enforcement."
          ]
        },
        {
          "scenario": "Family or trusted friend claims there are no long-term effects from using illegal substances purchased online",
          "recommendations": [
            "Understand that there are long-term effects associated with using illegal substances, and research online or seek guidance from a doctor for accurate information.",
            "If they feel threatened or coerced, reach out to law enforcement with them to report the situation.",
            "Provide assistance and offer guidance on how to find alternative solutions.",
            "Report them to the authorities if they become violent or engage in illegal activities."
          ]
        },
        {
          "scenario": "In any instance related to online drug trafficking, contacting law enforcement is crucial",
          "recommendations": [
            "Tell a trusted family member or friend about the situation to seek support and guidance.",
            "Report the incident to the appropriate authorities to initiate an investigation.",
            "Offer assistance to anyone who may be affected by the situation.",
            "Contact a local trusted friend or community leader for additional support and resources."
          ]
        }
      ]
    },
    {
      "crime": "rape",
      "scenarios": [
        {
          "scenario": "Being pressured into sexual activity when you don't want to",
          "recommendations": [
            "Say no firmly and assertively to make your boundaries clear.",
            "Remove yourself from the situation immediately to ensure your safety.",
            "Trust your instincts and prioritize your comfort and well-being.",
            "Seek support from a trusted friend, family member, counselor, or helpline to process your feelings."
          ]
        },
        {
          "scenario": "Feeling unsafe or uncomfortable in a social situation",
          "recommendations": [
            "Stay with a group of trusted friends to ensure safety in numbers.",
            "Avoid being alone with someone you don't trust or feel uneasy around.",
            "Be aware of your surroundings and any potential threats or risks.",
            "If you feel threatened or unsafe, leave the situation immediately and seek help if needed."
          ]
        },
        {
          "scenario": "Experiencing unwanted touching, advances, or sexual harassment",
          "recommendations": [
            "Tell the person to stop immediately and assertively to make your boundaries clear.",
            "Create physical distance between yourself and the person engaging in unwanted behavior.",
            "Report the behavior to the appropriate authorities, such as law enforcement or HR if it occurs in a workplace or educational institution.",
            "Seek legal counsel if you believe your rights have been violated or if you wish to pursue legal action."
          ]
        },
        {
          "scenario": "Worrying that someone you know has been sexually assaulted or harassed",
          "recommendations": [
            "Offer your unwavering support to those who need it and validate their experiences.",
            "Encourage them to report the incident to law enforcement or seek medical attention if appropriate.",
            "Provide resources for counseling, support groups, or legal assistance to help them cope and recover.",
            "Know that you are strong and can make a positive difference in their healing journey."
          ]
        },
        {
          "scenario": "Not sure about where to report a sexual assault or what to do",
          "recommendations": [
            "Contact local law enforcement, such as the police or cybercrime cell, to report the incident.",
            "Contact trusted family members and friends for emotional support and guidance.",
            "Offer to tell others or be an ally to survivors who may need assistance or encouragement.",
            "Seek trusted online resources to help in a secure and private location to help."
          ]
        },
        {
          "scenario": "Your friends promise to protect you but end up taking advantage of you",
          "recommendations": [
            "Avoid situations where you are alone or vulnerable with those people.",
            "Let law enforcement know about their behavior and file a report if necessary.",
            "Tell trusted friends and family members about what happened to seek support and protection.",
            "Terminate all contact with those individuals to protect yourself from further harm."
          ]
        },
        {
          "scenario": "A family member is sexually abusing or exploiting another family member",
          "recommendations": [
            "Contact law enforcement immediately to report the abuse and protect the victim.",
            "Get the victim away from the abusive family member to ensure their safety.",
            "Offer trusted guidance and support to the victim throughout the reporting and healing process.",
            "Avoid physical altercations or confrontations with the abuser.",
            "Alert trusted family friends or community members about the situation to seek additional support and resources."
          ]
        },
        {
          "scenario": "Someone online is offering sexual situations, threatening to share images, or engaging in blackmail",
          "recommendations": [
            "Contact law enforcement immediately to report the online harassment and threats.",
            "Delete them and anyone who might be with those people immediately, and secure the device.",
            "Seek counseling or mental health support to cope with the emotional distress caused by the online abuse.",
            "Alert family friends and seek out security."
          ]
        },
        {
          "scenario": "Worried about a partner acting strange, aggressive, or non-consensual during sexual relations",
          "recommendations": [
            "Avoid putting yourself in situations where you feel unsafe or uncomfortable with your partner.",
            "Talk with them to make sure they are not on drugs or experiencing any mental health issues.",
            "If you feel harmed or violated, contact the authorities to report the incident.",
            "Remember that you always have the choice whether or not to engage in sexual activities with your partner."
          ]
        },
        {
          "scenario": "You are being sexually taken advantage of but are unsure or confused about what is happening",
          "recommendations": [
            "Contact law enforcement to report the incident and seek guidance.",
            "Find a trusted friend, family member, or adult to confide in and seek support.",
            "Don't be afraid to ask for help and seek professional counseling or therapy.",
            "Let them know you want to be left alone and assert your boundaries."
          ]
        },
        {
          "scenario": "Not understanding what to do or where to turn when sexual activity feels wrong or abusive",
          "recommendations": [
            "Contact law enforcement to report the incident and seek legal guidance.",
            "Find a trusted friend, family member, or adult to confide in and seek support.",
            "Don't be afraid to ask for help and seek professional counseling or therapy.",
            "Let them know you want to be left alone and assert your boundaries."
          ]
        },
        {
          "scenario": "Feeling like there is no legal recourse to take after experiencing sexual abuse or assault",
          "recommendations": [
            "Contact law enforcement to report the incident and explore your legal options.",
            "Find a trusted friend, family member, or adult to confide in and seek support.",
            "Don't be afraid to ask for help from professionals or support organizations.",
            "Seek guidance online if resources cannot be found in person or through traditional channels."
          ]
        },
        {
          "scenario": "Someone is recording you without asking permission during sexual activity",
          "recommendations": [
            "Contact law enforcement immediately to report the illegal recording.",
            "Find a trusted friend, family member, or adult to confide in and seek support.",
            "Understand that this is a violation of your privacy and consent, and don't be afraid to speak out about what happened.",
            "If a relationship or connection is lost as a result, know that it is for good reason and prioritize your safety and well-being."
          ]
        },
        {
          "scenario": "Someone you know is acting strangely, aggressively, or inappropriately, but you don't know why",
          "recommendations": [
            "Avoid sexual situations or being alone with that person until you understand the cause of their behavior.",
            "Offer that person the opportunity to seek counseling or mental health support.",
            "Recognize that there is likely a valid reason for their behavior, and try to understand the situation before making assumptions.",
            "Protect yourself and make sure that you are not putting yourself in harm's way."
          ]
        },
        {
          "scenario": "You have experienced sexual assault or abuse",
          "recommendations": [
            "Contact law enforcement immediately to report the assault and seek legal recourse.",
            "Find a trusted friend, family member, or adult to confide in and seek emotional support.",
            "Remember that this is not your fault and you are not to blame for what happened.",
            "Make sure to provide as much detail about the event as possible to assist law enforcement in their investigation."
          ]
        },
        {
          "scenario": "If a friend or family member feels lost, confused, or distressed after a sexual assault, contact law enforcement immediately",
          "recommendations": [
            "If there is no contact with them, reach out to law enforcement or search party.",
            "Remember that this is not your fault.",
            "Make sure to provide as much detail about the event as possible to assist law enforcement in their search.",
            "Protect yourself and take necessary precautions."
          ]
        },
        {
          "scenario": "Avoid situations where people are not protected, respectful, or consensual",
          "recommendations": [
            "Leave or avoid those interactions to protect your safety and well-being.",
            "Take self-defense classes to empower yourself and learn how to protect yourself in dangerous situations.",
            "Don't be afraid to call for help or reach out to authorities if you feel threatened or unsafe.",
            "Know that you are the most important person in the room and your safety and well-being should always be prioritized."
          ]
        },
        {
          "scenario": "If sexual assault or abuse has already happened, what steps should you take next?",
          "recommendations": [
            "Reach out to law enforcement to report the incident and initiate a criminal investigation.",
            "Tell a trusted adult, such as a parent, teacher, or counselor, about what happened to seek guidance and support.",
            "Confide in a trusted friend who can provide emotional support and companionship.",
            "Seek guidance online if you are unable to find resources in person or through traditional channels."
          ]
        },
        {
          "scenario": "Reach out for mental health support to cope with the emotional trauma of sexual assault or abuse",
          "recommendations": [
            "Explore what mental health services are available in your area, such as counseling, therapy, or support groups.",
            "Understand that this is not your fault and you are not alone in your experiences.",
            "Recognize that there are actions that can be taken to improve the situation and support survivors of sexual violence.",
            "Stay strong and seek support from others who have experienced similar trauma."
          ]
        },
        {
          "scenario": "If there is an incident of sexual assault or abuse, report it to the authorities to initiate an investigation and seek justice",
          "recommendations": [
            "Contact law enforcement immediately to report the incident and provide them with all available information.",
            "Find a trusted friend, family member, or adult to confide in and seek support during the reporting process.",
            "Understand that there is guidance and support available to help you navigate this difficult event.",
            "Know that you are not alone and there are people who care about your safety and well-being."
          ]
        },
        {
          "scenario": "What to do when you don't know or trust someone and they are making you uncomfortable",
          "recommendations": [
            "Avoid sexual activities or intimate contact with individuals you do not know or trust.",
            "Avoid being in isolated locations or situations where you may be vulnerable.",
            "Inform authorities or seek help if you feel threatened, coerced, or unsafe.",
            "If an incident occurs or you feel that your boundaries have been violated, reach out to trusted individuals or authorities for support."
          ]
        }
      ]
    },
    {
      "crime": "sexual assault",
      "scenarios": [
        {
          "scenario": "Feeling uncomfortable with physical contact from someone",
          "recommendations": [
            "Clearly tell the person to stop immediately.",
            "Create physical distance to protect yourself.",
            "Remove yourself from the situation as soon as possible.",
            "Seek support from a trusted friend, family member, or counselor."
          ]
        },
        {
          "scenario": "Witnessing someone else being sexually harassed or assaulted",
          "recommendations": [
            "Intervene only if it is safe to do so.",
            "Offer support and reassurance to the victim.",
            "Report the behavior to authorities or workplace HR.",
            "Be an active bystander and speak out against inappropriate behavior."
          ]
        },
        {
          "scenario": "Experiencing a power imbalance in a relationship",
          "recommendations": [
            "Communicate your boundaries clearly and assertively.",
            "Seek counseling or support to address the power imbalance.",
            "If the behavior is abusive, consult legal counsel and consider ending the relationship.",
            "Contact authorities immediately if the situation worsens."
          ]
        },
        {
          "scenario": "Feeling isolated with no one to contact",
          "recommendations": [
            "Reach out to local law enforcement for help.",
            "Contact trusted authorities or helplines like CHILDLINE 1098.",
            "If you are a minor, talk to your parents or guardians.",
            "Remember, you are not alone and help is available."
          ]
        },
        {
          "scenario": "Minimizing the abuse because the person is a friend or family member",
          "recommendations": [
            "Understand that such behavior is unacceptable regardless of who it is.",
            "Report the abuse to law enforcement or trusted authorities.",
            "Seek support from counselors or helplines.",
            "Stay strong and know you are not alone."
          ]
        },
        {
          "scenario": "Feeling like there are no options",
          "recommendations": [
            "Know that options exist even if they are not immediately visible.",
            "Reach out to law enforcement or support organizations.",
            "Prioritize your safety and take necessary action.",
            "You are not alone—help is available."
          ]
        },
        {
          "scenario": "Not being believed when reporting abuse",
          "recommendations": [
            "Avoid harmful interactions and seek help from authorities or legal officials.",
            "If harm continues, report it immediately to law enforcement.",
            "Stay safe and take steps to protect yourself.",
            "Remember, you are not alone."
          ]
        },
        {
          "scenario": "Experiencing sexual harassment online",
          "recommendations": [
            "Inform trusted authorities and close friends about the harassment.",
            "Report the behavior to law enforcement and the platform involved.",
            "Avoid engaging with the harasser and protect your online privacy.",
            "Remember, you are not alone and support is available."
          ]
        },
        {
          "scenario": "Concerned that someone you know is being hurt",
          "recommendations": [
            "Know that you are not to blame for the situation.",
            "Offer to help and listen without judgment.",
            "Contact law enforcement if the person is in immediate danger.",
            "Provide guidance and assess if the family environment is safe.",
            "You are not alone in supporting them."
          ]
        },
        {
          "scenario": "Someone in danger is acting differently or unusually",
          "recommendations": [
            "Understand your concern is valid, even if you’re unsure.",
            "Gather as much information as possible and contact law enforcement.",
            "Provide support and encourage the person to seek help.",
            "You are not alone in your concern."
          ]
        },
        {
          "scenario": "A minor experiencing bad interactions online",
          "recommendations": [
            "Inform the child’s parents or guardians if the child feels safe sharing.",
            "If not, contact law enforcement immediately.",
            "Report imminent threats to authorities without delay.",
            "Avoid connecting with suspicious contacts and inform others.",
            "You are not alone."
          ]
        },
        {
          "scenario": "Facing a tough or unsupportive family environment",
          "recommendations": [
            "Do not hesitate to reach out to authorities even without family approval.",
            "Prioritize your safety and avoid harmful interactions.",
            "Offer yourself guidance that the abuse is not your fault.",
            "Remember, you are not alone."
          ]
        },
        {
          "scenario": "Being harassed in public or at events",
          "recommendations": [
            "Report the harassment to law enforcement immediately.",
            "Inform event managers or security personnel.",
            "Do not tolerate the presence of harassers around you.",
            "Seek out safe people who have your best interests at heart."
          ]
        },
        {
          "scenario": "Witnessing inappropriate acts or violence",
          "recommendations": [
            "Contact local authorities to report the incident.",
            "Inform a trusted authority figure or community leader.",
            "If there is an active threat, avoid interaction and seek safety.",
            "Remember, you are not at fault or imagining things."
          ]
        },
        {
          "scenario": "Feeling worried about something suspicious online",
          "recommendations": [
            "Report the activity to law enforcement or cybercrime authorities.",
            "Contact the website or platform to report inappropriate content.",
            "Seek support from trusted friends or online communities.",
            "Remember, your concerns are valid and you are not alone."
          ]
        },
        {
          "scenario": "If a coworker is taking advantage of you",
          "recommendations": [
            "Report the behavior to your company’s HR department.",
            "Contact law enforcement if the situation escalates or involves criminal acts.",
            "Consider looking for other job opportunities if the environment is unsafe.",
            "Review your company’s code of conduct and policies on harassment.",
            "Remember, you deserve respect and safety at work."
          ]
        },
        {
          "scenario": "If your boss won't leave you alone or harasses you",
          "recommendations": [
            "Review your company’s harassment policies and grievance procedures.",
            "Report the behavior to HR or higher management.",
            "Contact law enforcement if the harassment violates the law.",
            "Do not hesitate to defend your rights and seek alternative employment if necessary."
          ]
        },
        {
          "scenario": "Someone is making inappropriate or bad comments",
          "recommendations": [
            "Ignore the comments and avoid engaging with the person.",
            "Report the behavior to authorities or platform moderators.",
            "Inform friends and family to build a support network.",
            "Remember that many people online behave rudely; protect your mental health by not engaging."
          ]
        },
        {
          "scenario": "Not feeling safe around friends or family",
          "recommendations": [
            "Avoid interactions that make you uncomfortable or unsafe.",
            "Report any abusive behavior to authorities.",
            "Know that you are not imagining things and your feelings are valid.",
            "Seek assistance from trusted individuals or support organizations."
          ]
        },
        {
          "scenario": "Feeling like someone has taken advantage of you",
          "recommendations": [
            "Seek guidance and professional help to process your experience.",
            "Understand that what happened is not normal or acceptable.",
            "Avoid situations or people that cause distress and take time for self-care.",
            "Consult a lawyer or trusted official if you wish to pursue legal action."
          ]
        }
      ]
    },
    {
      "crime": "homicide",
      "scenarios": [
        {
          "scenario": "Witnessing a violent altercation or threat",
          "recommendations": [
            "Prioritize your safety and leave the area immediately.",
            "Call emergency services (police) to report the incident without delay.",
            "Provide a detailed and accurate account of what you witnessed to law enforcement."
          ]
        },
        {
          "scenario": "Receiving threats or intimidation",
          "recommendations": [
            "Take all threats seriously and report them promptly to law enforcement.",
            "Document every instance of threats with dates, times, and specific details.",
            "Seek a restraining order if you feel your safety is at risk."
          ]
        },
        {
          "scenario": "Having knowledge of someone planning to harm others",
          "recommendations": [
            "Immediately contact law enforcement and share all relevant information.",
            "Cooperate fully with authorities to help prevent harm.",
            "Do not attempt to intervene personally if it may put you in danger."
          ]
        },
        {
          "scenario": "Finding or stumbling upon illegal substances or suspicious activity",
          "recommendations": [
            "Do not engage or confront anyone involved.",
            "Contact authorities to report the situation and request assistance.",
            "Avoid putting yourself in harm’s way and inform trusted friends or family.",
            "Stay vigilant and prioritize your safety."
          ]
        },
        {
          "scenario": "If you have been threatened",
          "recommendations": [
            "Reach out to law enforcement immediately.",
            "Remember you have the power to remove yourself from dangerous situations.",
            "If a weapon is involved, prioritize your safety and call for help.",
            "Protect yourself by seeking shelter or safe spaces."
          ]
        },
        {
          "scenario": "Worried about family being around a dangerous person",
          "recommendations": [
            "Discuss your concerns openly with your family and encourage caution.",
            "Understand that you cannot control others’ actions but can offer support.",
            "Provide security measures where possible to protect your loved ones.",
            "Stay vigilant and maintain open communication."
          ]
        },
        {
          "scenario": "Someone comes to your door threatening you",
          "recommendations": [
            "Call the police immediately to report the threat.",
            "Assess available resources such as neighbors or security services.",
            "Recognize that such behavior is not normal and take protective actions.",
            "Avoid confrontation and prioritize your safety."
          ]
        },
        {
          "scenario": "People are coming to your door and you are concerned",
          "recommendations": [
            "Contact law enforcement to discuss security measures for your home.",
            "Implement recommended safety steps such as locks or alarms.",
            "Stay alert and protect yourself and your family at all times.",
            "Inform trusted neighbors or community members about your concerns."
          ]
        },
        {
          "scenario": "Someone is acting suspiciously around your car",
          "recommendations": [
            "Report the suspicious activity to law enforcement promptly.",
            "Do not engage or confront the individual directly.",
            "Stay safe by avoiding using the vehicle until the situation is resolved."
          ]
        },
        {
          "scenario": "Encountering suspicious behavior or individuals",
          "recommendations": [
            "Leave the area immediately and avoid any interaction.",
            "Be aware that some individuals may pose a threat to your safety.",
            "Contact law enforcement if you feel threatened or observe violent behavior.",
            "Take steps to prevent escalation and protect yourself."
          ]
        },
        {
          "scenario": "Handling dangerous situations inside your home",
          "recommendations": [
            "Stay calm and follow the instructions of any intruders to avoid escalation.",
            "Look for an opportunity to safely exit the premises.",
            "Call for help as soon as you are in a safe location.",
            "Avoid actions that could provoke violence."
          ]
        },
        {
          "scenario": "Knowing someone may want to harm you",
          "recommendations": [
            "Seek guidance from trusted authorities or counselors.",
            "Get help from law enforcement or support organizations.",
            "Do not allow threats to control your actions; prioritize your safety.",
            "Take necessary precautions to secure yourself and your environment."
          ]
        },
        {
          "scenario": "Improving your response to violent situations",
          "recommendations": [
            "Report any threats or violent incidents to law enforcement immediately.",
            "Call emergency services (e.g., 100 in India) when necessary.",
            "Stay aware of your surroundings and avoid potentially violent areas.",
            "Avoid confrontation whenever possible."
          ]
        },
        {
          "scenario": "Dealing with rowdy or violent situations in public",
          "recommendations": [
            "Stay calm and avoid escalating the situation if you are not in immediate danger.",
            "Prioritize your safety and remove yourself from the conflict.",
            "Avoid engaging with aggressive individuals or groups.",
            "Look out for friends or others who may need assistance."
          ]
        },
        {
          "scenario": "Being hurt by friends or family",
          "recommendations": [
            "Seek guidance and support from trusted individuals or professionals.",
            "If you are not believed, distance yourself from those who do not support you.",
            "Recognize that abuse is never acceptable, regardless of who it comes from.",
            "Always tell the truth and seek help."
          ]
        },
        {
          "scenario": "Someone threatens your reputation or legal standing",
          "recommendations": [
            "Know that there are legal steps you can take to protect yourself.",
            "Contact law enforcement and seek their advice.",
            "Consult a legal counselor for assistance and representation.",
            "Call emergency services if you feel immediate danger."
          ]
        },
        {
          "scenario": "Avoiding people who are frequently involved in trouble",
          "recommendations": [
            "Limit or avoid contact with individuals who consistently cause problems.",
            "Recognize that such associations can lead to dangerous situations.",
            "Focus on building relationships with positive and supportive people.",
            "Take responsibility for your own safety and well-being."
          ]
        },
        {
          "scenario": "Understanding the potential for violence from someone",
          "recommendations": [
            "Inform local law enforcement if you suspect someone is dangerous.",
            "Recognize warning signs and avoid individuals who may pose a threat.",
            "Keep a safe distance and avoid being alone with such individuals.",
            "Report any suspicious or threatening behavior promptly."
          ]
        },
        {
          "scenario": "Recognizing that bad situations can escalate quickly",
          "recommendations": [
            "Be aware of your surroundings and potential risks.",
            "Avoid places or situations where violence is more likely to occur.",
            "Have a plan for how to respond or escape if danger arises.",
            "Take immediate action to protect yourself if threatened."
          ]
        },
        {
          "scenario": "Avoiding contact when you have been threatened or feel unsafe",
          "recommendations": [
            "If possible, stay away from the threatening individual or situation.",
            "Tell trusted people who can help protect you and keep you safe.",
            "Seek guidance from law enforcement or support organizations.",
            "Remember that your feelings are valid and your safety is paramount."
          ]
        }
      ]
    },
    {
      "crime": "robbery",
      "scenarios": [
        {
          "scenario": "Walking alone at night in an unsafe area",
          "recommendations": [
            "Avoid walking alone in poorly lit or known high-crime areas, especially at night.",
            "Stay vigilant and aware of your surroundings; avoid distractions such as using your phone.",
            "Carry a personal safety alarm or whistle to attract attention in case of an emergency.",
            "If confronted by a robber, comply with their demands and do not resist, as your safety is paramount."
          ]
        },
        {
          "scenario": "Approaching an ATM in a secluded location",
          "recommendations": [
            "Use ATMs located in well-lit and public areas to minimize risk.",
            "Assess your surroundings carefully before approaching the ATM to identify any potential threats.",
            "Shield the PIN pad with your hand when entering your PIN to prevent observation.",
            "If you feel unsafe or notice suspicious activity, leave immediately and use a different ATM."
          ]
        },
        {
          "scenario": "Opening your door to a stranger",
          "recommendations": [
            "Verify the person's identity through the peephole or window before opening the door.",
            "If they claim to be a service representative, ask for official identification.",
            "If you are not expecting anyone or feel unsure, do not open the door.",
            "Contact law enforcement if you feel threatened or suspect malicious intent."
          ]
        },
        {
          "scenario": "Walking a friend home",
          "recommendations": [
            "Choose well-lit and safe routes, avoiding shortcuts or isolated areas.",
            "Be alert and aware of your surroundings throughout the walk.",
            "If a robbery occurs, prioritize safety and avoid resistance.",
            "Attempt to call for help discreetly if possible."
          ]
        },
        {
          "scenario": "Experiencing a dangerous situation",
          "recommendations": [
            "If immediate harm or threat is present, seek help from authorities.",
            "Avoid engaging in dangerous acts or taking unnecessary risks.",
            "Explore available options carefully and seek guidance if needed.",
            "In a robbery, prioritize safety and contact local authorities afterward."
          ]
        },
        {
          "scenario": "People around you are engaging in dangerous activities",
          "recommendations": [
            "Avoid putting yourself at risk by distancing yourself from those activities.",
            "Remember, you are not the enemy; prioritize your well-being.",
            "Use provided safety recommendations to protect yourself and others.",
            "Avoid those interactions and those people."
          ]
        },
        {
          "scenario": "Protecting family involved in dangerous activities",
          "recommendations": [
            "Express your concern about their safety without putting yourself at risk.",
            "Protect yourself and encourage them to prioritize their safety.",
            "If their involvement causes harm to the family, consider involving law enforcement.",
            "Make your feelings about their choices clear, emphasizing your love and concern for their well-being."
          ]
        },
        {
          "scenario": "Suspecting someone's intentions are malicious",
          "recommendations": [
            "Try to avoid contact with the individual.",
            "Understand that they may want something from you and be prepared to disengage.",
            "Be authentic and true to yourself in your interactions.",
            "Recognize that engaging with them will only lead to harm."
          ]
        },
        {
          "scenario": "Feeling stressed and unsure of what to do",
          "recommendations": [
            "Reach out to local authorities or trusted community members for support.",
            "Take time for self-care to alleviate stress and anxiety.",
            "Surround yourself with supportive people to ensure your safety.",
            "Seek professional help for guidance in managing stress and uncertainty."
          ]
        },
        {
          "scenario": "Hearing people talk about engaging in dangerous behavior",
          "recommendations": [
            "Avoid those people at all costs and keep it to yourself.",
            "What has happened is in the past and try to avoid in the future.",
            "The situation is to be handled and stop to see what happens.",
            "Most can't be trusted so remember to be safe."
          ]
        },
        {
          "scenario": "When confronted with dangerous situations, you need to avoid.",
          "recommendations": [
            "If those people are asking for help. It is important to not fall for it and don't engage for they have hidden intention",
            "These actions will pass and the action may come again but remember to value your life more then those actions",
            "The world wants to see you safe don't put yourself at risk for the secrets are about to be seen. What they may have to hurt or to make you hurt is going to come up very soon",
            "There are all times to share but at your own discretion."
          ]
        },
        {
          "scenario": "In a bad situation make sure to be open to who is not safe.",
          "recommendations": [
            "Those people may have a bad intention to cause you harm and it's okay to not trust everyone. Remember always to be true.",
            "The more there is it is important to find safe zones and stay true",
            "Many can harm you and it is okay.",
            "Remember your inner spirit is great. Make it be good for you for no harm is important.",
            "Always treat everyone with respect and know what's good with what you do."
          ]
        },
        {
          "scenario": "If you know better don't engage for there are paths that should be avoided.",
          "recommendations": [
            "Those actions are never good to go though with it make sure to always be safe first. If they did ask for help let those actions pass to make sure to protect.",
            "You should always be you. Never let those actions come and it is good to know to find some action with yourself. Never look back always look forward.",
            "Those individuals are never what you need and what you do never be someone what is need for your own life.",
            "Never look what is for action and always remember love in the situation."
          ]
        },
        {
          "scenario": "If the people are doing actions for good or for bad action you always avoid.",
          "recommendations": [
            "Protect with local authorities what ever is good. You are always good in the situation.",
            "What will is going to take with the good with you is what is going to be okay. Never be someone you never know with what that action has in the game.",
            "You can never always take steps for it will take everything and action is never better. It is important to do a thing to understand everything. ",
            "Learn never to repeat those wrong actions because everything that comes what you get actions with you in a lot of actions for life."
          ]
        },
        {
          "scenario": "What to do when you do is the love with actions to be had and you are hurt.",
          "recommendations": [
            "It is never what they want and actions are bad so the safety is up to what can you learn. Tell authorities to keep the individual safe. ",
            "Know that action is the actions and no one is to have those thoughts is for action.",
            "The harms actions with you don't make up or do what is for your life but the most and remember you are everything that you ever do.",
            "They will be good to always know."
          ]
        },
        {
          "scenario": "Be with yourself to better what may lead. Do not let the actions take over.",
          "recommendations": [
            "These actions from you make it clear what to be do not let action to what makes the action with you hurt. ",
            "It is always action for the contact for all the people with what the good they want and let the lesson begin. Never be afraid of what to never go what needs to make",
            "There is with all action and the most is never for the action there actions there all to protect. Be with all make it be there action and more with the actions to ever see with you."
          ]
        },
        {
          "scenario": "How will love and actions be with there truth",
          "recommendations": [
            "Avoid the actions what will not make what it will give or take what is more safe. Be action to those times of need for more for you.",
            "Actions take the most so what is important is always with you don't let for more is safe with what is. Do it and understand.",
            "Protect you that make no love and those steps are never what to be scared to it so you be.",
            "There is to it is is better than what not may be to see. Always have some safety to contact but no what has that love."
          ]
        },
        {
          "scenario": "Actions with trust has to be with you action or not",
          "recommendations": [
            "Always never take actions on actions that are for you to not have those actions. There is more what does is those not in what to feel.",
            "This may happen for the best or the more what is good will and what to reach and see action for safe and be with what is.",
            "Don't never be scared so that there are things you can reach. To that never be scared and you are better than what is.",
            "Actions come with safety all the time to what actions to tell and make good with actions."
          ]
        },
        {
          "scenario": "With the good avoid actions to have and know to be the more safe and smart",
          "recommendations": [
            "Protect you know that it actions what is good and they what not for what is to be and never let that be scared for what is what the most what you do there and protect there love.",
            "Actions what the best will make those be love what is has ever to ever make and action is. Always understand for what to never protect what is to never.",
            "You can be all of those good of action that all the time it make to do what does come from",
            "You always there is and there the to always reach."
          ]
        }
      ]
    },
    {
      "crime": "Theft",
      "scenarios": [
        {
          "scenario": "Witnessing suspicious behavior that could lead to theft.",
          "recommendations": [
            "If you are not 100% sure then avoid.",
            "It is more important to remove from the situation for it sounds good.",
            "What happens is that you are being you and what is better can do for more",
            "Take the steps forward"
          ]
        },
        {
          "scenario": "Being pressured to participate in a theft.",
          "recommendations": [
            "Protect people so tell them of action",
            "It can lead to greater things so report",
            "Be careful and think of not doing what did do",
            "Think of safety with not doing."
          ]
        },
        {
          "scenario": "Unsure of immediate actions after a theft",
          "recommendations": [
            "If you've been a victim of theft or witness one, contact the local police immediately.",
            "Your safety should be your utmost concern during and after a theft.",
            "The police are equipped to provide the necessary assistance and investigate.",
            "Contacting them promptly can aid in the recovery of stolen goods and apprehension of culprits."
          ]
        },
        {
          "scenario": "Feeling emotionally distressed after a theft incident",
          "recommendations": [
            "Focus on ensuring your physical and emotional safety after a theft.",
            "Reach out to friends, family, or community leaders for support and advice.",
            "Do not allow fear to overwhelm you; take proactive steps to restore normalcy.",
            "Remember, you're not alone, and seeking help is a sign of strength."
          ]
        },
        {
          "scenario": "Wanting to prevent further losses from occurring",
          "recommendations": [
            "Refrain from engaging in theft or illegal activities to acquire wealth; choose honest means.",
            "Understand the emotional and financial pain that theft inflicts on victims.",
            "Strive for moral and ethical conduct, respecting others' property rights.",
            "Recognize that true prosperity comes from hard work, honesty, and compassion."
          ]
        },
        {
          "scenario": "Reflecting on your role in a theft incident",
          "recommendations": [
            "If you were involved, reflect on your choices and consider the impact on others.",
            "Consider how to react to the consequences, such as legal penalties or social stigma.",
            "Plan what actions to take to rectify the situation and avoid similar mistakes.",
            "If you were hurt, prioritize healing, both emotionally and physically."
          ]
        },
        {
          "scenario": "Discovering your friends are involved in theft",
          "recommendations": [
            "Discourage your friends from participating in theft or any illegal activities.",
            "If they continue, create distance to protect yourself from potential legal repercussions.",
            "Carefully assess who to confide in about the situation, seeking trustworthy counsel.",
            "Protect yourself by disassociating from their actions and reporting to local law enforcement."
          ]
        },
        {
          "scenario": "Confronted with whether to admit to stealing something",
          "recommendations": [
            "Acknowledge your mistake, return the stolen item and offer a sincere apology.",
            "Ensure that your actions reflect a commitment to ethical and legal standards.",
            "Learn from the experience and strive to avoid future transgressions.",
            "Consider the potential harm caused by your actions and commit to making amends."
          ]
        },
        {
          "scenario": "Deciding what to do if someone persists in theft despite warnings",
          "recommendations": [
            "Inform local authorities or legal professionals to report the repeated theft.",
            "Emphasize the seriousness of the situation to discourage continued offenses.",
            "Protect your property by implementing security measures such as locks or alarms.",
            "Know it is important to act responsibly and firmly when facing habitual wrongdoings."
          ]
        },
        {
          "scenario": "After theft what measure should be taken",
          "recommendations": [
            "Focus on learning from the experience and strengthening your resolve to act ethically.",
            "Recognize that mistakes happen, but you can choose to embrace honesty and integrity.",
            "Use the incident as a catalyst for personal growth and positive change.",
            "Remember you are actions of who you surround yourself with."
          ]
        },
        {
          "scenario": "What if Someone says it's not you to take actions",
          "recommendations": [
            "Take reasonable steps to clarify your position and prevent misunderstandings.",
            "Protect your well-being and reputation, seeking guidance from trusted sources.",
            "Ensure your actions align with your values and principles.",
            "Strive for ethical conduct and respect for others' property rights."
          ]
        },
        {
          "scenario": "Someone is telling to steal",
          "recommendations": [
            "Make sure to act with caution and understand",
            "Actions may cause a consequence that is not understood so stop",
            "Contact your lawyer to protect your actions."
          ]
        },
        {
          "scenario": "Discovering someone you know is planning a theft.",
          "recommendations": [
            "Reach what is there to give",
            "With action come to light to not fear actions.",
            "It for action.",
            "Those people may have a good idea but know it is bad for what may come."
          ]
        },
        {
          "scenario": "Suspecting that a theft is about to occur.",
          "recommendations": [
            "Inform local authorities and make sure people are safe.",
            "Actions speak so understand with protect.",
            "Who will have there care and what is important so go forward.",
            "Always protect if what can can action but be safe."
          ]
        },
        {
          "scenario": "If those actions had.",
          "recommendations": [
            "Those actions should be what.",
            "Tell action.",
            "Follow what happen for more that the actions is with in you protect that. What can protect with harm",
            "There is for those actions with better."
          ]
        }
      ]
    }    
  ]
}